./ ADD NAME=DEMOESY3                                                    BUILDJCL
//* ==> DELETE THE IEBUPDTE CONTROL STATEMENT ABOVE.                    BUILDJCL
//* ==> PUT JOB CARD INFORMATION IN FRONT AS NEEDED.                    BUILDJCL
//*                                                                     BUILDJCL
//JOBLIB   DD DSN=????.???????,DISP=SHR                                 BUILDJCL
//* ==> LIBRARIES IN THE JOBLIB ABOVE MUST BE TAILORED !                BUILDJCL
//*  1) CONSULT WITH SYSTEM PROGRAMMER FOR COBOL RUNTIME LIBS:          BUILDJCL
//*     A) FOR COBOL/390, YOU WILL NEED CEE.SCEERUN OR EQUIVALENT.      BUILDJCL
//*  2) ADD LOADLIB THAT CONTAINS LOAD MODULE OF YOUR COBOL PROGRAM.    BUILDJCL
//*                                                                     BUILDJCL
//*-------------------------------------------------------------------* BUILDJCL
//* DEMOESY3 INSTREAM PROCEDURE.                                      * BUILDJCL
//*-------------------------------------------------------------------* BUILDJCL
//DEMOESY3 PROC  SYSOUT='*',                                            BUILDJCL
//         FILEIN='????????.INPUT.FILE',                                BUILDJCL
//         FILEOUT='????????.OUTPUT.FILE',                              BUILDJCL
//         PARAM=                    .POSSIBLE PARM OPTIONS IF ANY      BUILDJCL
//*                                                                     BUILDJCL
//*-------------------------------------------------------------------* BUILDJCL
//* DEMOESY3 RUN PROCEDURE                                            * BUILDJCL
//*-------------------------------------------------------------------* BUILDJCL
//STEP000   EXEC PGM=DEMOESY3,REGION=4096K,PARM=(&PARAM)                BUILDJCL
//SYSOUT    DD SYSOUT=&SYSOUT                                           BUILDJCL
//FJSYABE   DD SYSOUT=&SYSOUT                                           BUILDJCL
//SYSLIST   DD SYSOUT=&SYSOUT                                           BUILDJCL
//SYSPRINT  DD SYSOUT=&SYSOUT                                           BUILDJCL
//SYSUDUMP  DD SYSOUT=&SYSOUT                                           BUILDJCL
//SYSABOUT  DD SYSOUT=&SYSOUT                                           BUILDJCL
//*                                                                     BUILDJCL
//*-------- FILES INPUT TO DEMOESY3 ----------------------------------* BUILDJCL
//FILEIN    DD DSN=&FILEIN,                                             BUILDJCL
//          DISP=SHR                                                    BUILDJCL
//*                                                                     BUILDJCL
//*-------- FILES CREATED BY DEMOESY3 --------------------------------* BUILDJCL
//FILEOUT   DD DSN=&FILEOUT,                                            BUILDJCL
//          DCB=(LRECL=80,BLKSIZE=,RECFM=FB),                           BUILDJCL
//          SPACE=(CYL,(010,02)),                                       BUILDJCL
//          DISP=(NEW,CATLG)                                            BUILDJCL
//*                                                                     BUILDJCL
//*-------- WORK FILES USED IN DEMOESY3 ------------------------------* BUILDJCL
//*                                                                     BUILDJCL
//*-------- REPORTS GENERATED BY DEMOESY3 ----------------------------* BUILDJCL
//REPORT1   DD SYSOUT=&SYSOUT                                           BUILDJCL
//*                                                                     BUILDJCL
//*-------- END OF GENERATED PROCEDURE DEMOESY3 ----------------------* BUILDJCL
// PEND                                                                 BUILDJCL
//*                                                                     BUILDJCL
//STEP001   EXEC PROC=DEMOESY3                                          BUILDJCL
/*                                                                      BUILDJCL
//                                                                      BUILDJCL